vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM35Z7_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs='http://www.w3.org/2001/XMLSchema-instance' xs:noNamespaceSchemaLocation='PACK.xsd' schemaVersion='1.4'>
  <name>MKM35Z7_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MKM35Z7</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version='25.06.00' date='2025-06-24'>NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
    <release version='25.03.00' date='2025-03-28'>NXP CMSIS Packs based on MCUXpresso SDK 25.03.00</release>
    <release version='19.0.0' date='2024-07-17'>NXP CMSIS Packs based on MCUXpresso SDK 2.16.0</release>
    <release version='18.0.0' date='2024-01-14'>NXP CMSIS Packs based on MCUXpresso SDK 2.15.0</release>
    <release version='17.0.0' date='2023-07-27'>NXP CMSIS Packs based on MCUXpresso SDK 2.14.0</release>
    <release version='16.0.0' date='2023-01-16'>NXP CMSIS Packs based on MCUXpresso SDK 2.13.0</release>
    <release version='15.0.0' date='2022-07-13'>NXP CMSIS Packs based on MCUXpresso SDK 2.12.0</release>
    <release version='14.0.0' date='2022-01-05'>NXP CMSIS Packs based on MCUXpresso SDK 2.11.0</release>
    <release version='13.1.0' date='2021-07-13'>NXP CMSIS Packs based on MCUXpresso SDK 2.10.0</release>
    <release version='13.0.0' date='2021-02-05'>
      NXP CMSIS Packs based on MCUXpresso SDK 2.9.0 with restructured startup component files
    </release>
    <release version='12.2.0' date='2021-01-14'>NXP CMSIS Packs based on MCUXpresso SDK 2.9.0</release>
    <release version='12.1.0' date='2020-07-20'>NXP CMSIS Packs based on MCUXpresso SDK 2.8.0</release>
    <release version='12.0.0' date='2020-03-30'>NXP CMSIS Packs based on MCUXpresso SDK 2.7.1</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name='CMSIS' vendor='ARM' version='6.1.0'/>
    </packages>
    <languages>
      <language name='C' version='99'/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily='MKM35Z7' Dvendor='NXP:11'>
      <description>
        Kinetis KM3x-50–75 MHz Precision Metrology with Segment LCD MCUs based on ARM Cortex-M0+
      </description>
      <device Dname='MKM35Z512xxx7'>
        <processor Dcore='Cortex-M0+' Dfpu='NO_FPU' Dmpu='NO_MPU' Dendian='Little-endian' Dclock='75000000'/>
        <environment name='iar'>
          <file category='linkerfile' name='devices/MKM35Z7/iar/MKM35Z512xxx7_flash.icf'/>
        </environment>
        <memory name='PROGRAM_FLASH' start='0x00000000' size='0x080000' access='rx' default='1' startup='1'/>
        <memory name='SRAM' start='0x1fffc000' size='0x010000' access='rw' default='1'/>
        <algorithm name='devices/MKM35Z7/arm/MKMP512_2KB.FLM' start='0x00000000' size='0x00080000' RAMstart='0x20000000' RAMsize='0x00001000' default='1'/>
        <debug svd='devices/MKM35Z7/MKM35Z7.xml'/>
        <variant Dvariant='MKM35Z512VLQ7'>
          <compile header='devices/MKM35Z7/fsl_device_registers.h' define='CPU_MKM35Z512VLQ7'/>
        </variant>
        <variant Dvariant='MKM35Z512VLL7'>
          <compile header='devices/MKM35Z7/fsl_device_registers.h' define='CPU_MKM35Z512VLL7'/>
        </variant>
        <variant Dvariant='MKM35Z512VLQ7R'>
          <compile header='devices/MKM35Z7/fsl_device_registers.h' define='CPU_MKM35Z512VLQ7R'/>
        </variant>
        <variant Dvariant='MKM35Z512VLL7R'>
          <compile header='devices/MKM35Z7/fsl_device_registers.h' define='CPU_MKM35Z512VLL7R'/>
        </variant>
      </device>
      <device Dname='MKM35Z256xxx7'>
        <processor Dcore='Cortex-M0+' Dfpu='NO_FPU' Dmpu='NO_MPU' Dendian='Little-endian' Dclock='75000000'/>
        <environment name='iar'>
          <file category='linkerfile' name='devices/MKM35Z7/iar/MKM35Z256xxx7_flash.icf'/>
        </environment>
        <memory name='PROGRAM_FLASH' start='0x00000000' size='0x040000' access='rx' default='1' startup='1'/>
        <memory name='SRAM' start='0x1fffc000' size='0x010000' access='rw' default='1'/>
        <algorithm name='devices/MKM35Z7/arm/MKMP512_2KB.FLM' start='0x00000000' size='0x00040000' RAMstart='0x20000000' RAMsize='0x00001000' default='1'/>
        <debug svd='devices/MKM35Z7/MKM35Z7.xml'/>
        <variant Dvariant='MKM35Z256VLQ7'>
          <compile header='devices/MKM35Z7/fsl_device_registers.h' define='CPU_MKM35Z256VLQ7'/>
        </variant>
        <variant Dvariant='MKM35Z256VLL7'>
          <compile header='devices/MKM35Z7/fsl_device_registers.h' define='CPU_MKM35Z256VLL7'/>
        </variant>
        <variant Dvariant='MKM35Z256VLQ7R'>
          <compile header='devices/MKM35Z7/fsl_device_registers.h' define='CPU_MKM35Z256VLQ7R'/>
        </variant>
        <variant Dvariant='MKM35Z256VLL7R'>
          <compile header='devices/MKM35Z7/fsl_device_registers.h' define='CPU_MKM35Z256VLL7R'/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id='device.MKM35Z7.internal_condition'>
      <accept Dname='MKM35Z512VLL7' Dvendor='NXP:11'/>
      <accept Dname='MKM35Z512VLL7R' Dvendor='NXP:11'/>
      <accept Dname='MKM35Z512VLQ7' Dvendor='NXP:11'/>
      <accept Dname='MKM35Z512VLQ7R' Dvendor='NXP:11'/>
      <accept Dname='MKM35Z256VLL7' Dvendor='NXP:11'/>
      <accept Dname='MKM35Z256VLL7R' Dvendor='NXP:11'/>
      <accept Dname='MKM35Z256VLQ7' Dvendor='NXP:11'/>
      <accept Dname='MKM35Z256VLQ7R' Dvendor='NXP:11'/>
    </condition>
    <condition id='cmake_toolchain.condition_id'>
      <require condition='allOf.device=MKM35Z7.internal_condition'/>
    </condition>
    <condition id='allOf.device=MKM35Z7.internal_condition'>
      <require condition='device.MKM35Z7.internal_condition'/>
    </condition>
    <condition id='component.Legacy_flash_adapter.condition_id'>
      <require condition='allOf.driver.flash, device=MKM35Z7.internal_condition'/>
    </condition>
    <condition id='allOf.driver.flash, device=MKM35Z7.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flash'/>
      <require condition='device.MKM35Z7.internal_condition'/>
    </condition>
    <condition id='component.cmsis_drivers.condition_id'>
      <require condition='allOf.device=MKM35Z7.internal_condition'/>
    </condition>
