vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM35Z7_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_dma' Cversion='2.0.9' condition='driver.i2c_dma.condition_id'>
      <description>I2C Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM35Z7/drivers/fsl_i2c_dma.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM35Z7/drivers/fsl_i2c_dma.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM35Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_edma' Cversion='2.0.9' condition='driver.i2c_edma.condition_id'>
      <description>I2C Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM35Z7/drivers/fsl_i2c_edma.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM35Z7/drivers/fsl_i2c_edma.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM35Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='rtc' Cversion='2.3.2' condition='driver.irtc.condition_id'>
      <description>IRTC Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM35Z7/drivers/fsl_irtc.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM35Z7/drivers/fsl_irtc.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM35Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='llwu' Cversion='2.0.5' condition='driver.llwu.condition_id'>
      <description>LLWU Driver</description>
      <files>
        <file category='header' name='devices/MKM35Z7/drivers/fsl_llwu.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM35Z7/drivers/fsl_llwu.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM35Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lptmr' Cversion='2.2.0' condition='driver.lptmr.condition_id'>
      <description>LPTMR Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM35Z7/drivers/fsl_lptmr.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM35Z7/drivers/fsl_lptmr.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM35Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart' Cversion='2.9.1' condition='driver.lpuart.condition_id'>
      <description>LPUART Driver</description>
      <files>
        <file category='header' name='devices/MKM35Z7/drivers/fsl_lpuart.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM35Z7/drivers/fsl_lpuart.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM35Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart_dma' Cversion='2.6.0' condition='driver.lpuart_dma.condition_id'>
      <description>LPUART Driver</description>
      <files>
        <file category='header' name='devices/MKM35Z7/drivers/fsl_lpuart_dma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM35Z7/drivers/fsl_lpuart_dma.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM35Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mmau' Cversion='2.0.1' condition='driver.mmau.condition_id'>
      <description>MMAU Driver</description>
      <files>
        <file category='header' name='devices/MKM35Z7/drivers/fsl_mmau.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM35Z7/drivers/fsl_mmau.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM35Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='pdb' Cversion='2.0.4' condition='driver.pdb.condition_id'>
      <description>PDB Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM35Z7/drivers/fsl_pdb.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM35Z7/drivers/fsl_pdb.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM35Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='pit' Cversion='2.2.0' condition='driver.pit.condition_id'>
      <description>PIT Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM35Z7/drivers/fsl_pit.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM35Z7/drivers/fsl_pit.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM35Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='pmc' Cversion='2.0.3' condition='driver.pmc.condition_id'>
      <description>PMC Driver</description>
      <files>
        <file category='header' name='devices/MKM35Z7/drivers/fsl_pmc.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM35Z7/drivers/fsl_pmc.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM35Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='port' Cversion='2.5.1' condition='driver.port.condition_id'>
      <description>PORT Driver</description>
      <files>
        <file category='header' name='devices/MKM35Z7/drivers/fsl_port.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM35Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='qtmr' Cversion='2.0.1' condition='driver.qtmr_2.condition_id'>
      <description>QTMR Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM35Z7/drivers/fsl_qtmr.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM35Z7/drivers/fsl_qtmr.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM35Z7/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='rcm' Cversion='2.0.4' condition='driver.rcm.condition_id'>
      <description>RCM Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM35Z7/drivers/fsl_rcm.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM35Z7/drivers/fsl_rcm.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM35Z7/drivers/'/>
      </files>
    </component>
